Repository: BetterACS/brainboost
Catalog: lib/l10n/intl_*.arb
Languages: th

source: Hello Again
th: สวัสดีอีกครั้ง

source: Email Address
th: อีเมล

source: Password
th: รหัสผ่าน

source: Sign In
th: เข้าสู่ระบบ

source: New User?
th: ผู้ใช้ใหม่?

source: Create Account
th: สร้างบัญชี

source: Register Account
th: ลงทะเบียนบัญชี

source: Sign Up
th: สมัครสมาชิก

source: Already Have Account?
th: มีบัญชีอยู่แล้ว?

source: Log In
th: เข้าสู่ระบบ

source: Settings
th: การตั้งค่า

# settingsPageTitle
source: This is Settings Page
th: นี่คือหน้าการตั้งค่า

# errorTitle
source: Oops!
th: อุ๊ปส์!

# errorMessage
source: Something went wrong Please try again or upload a new file.
th: เกิดข้อผิดพลาดบางอย่าง โปรดลองอีกครั้งหรืออัปโหลดไฟล์ใหม่

# tryAgain
source: Next
th: ถัดไป

source: Edit File
th: แก้ไขไฟล์

source: Close
th: ปิด

# successTitle
source: Success!
th: สำเร็จ!

# successMessage
source: Your game has been created successfully
th: เกมของคุณถูกสร้างเรียบร้อยแล้ว

source: Start Playing
th: เริ่มเล่น

source: View My Games
th: ดูเกมของฉัน

source: New Game
th: เกมใหม่

# loadingGames
source: Loading your games...
th: กำลังโหลดเกมของคุณ...

source: Game title updated!
th: ชื่อเกมได้รับการอัปเดตแล้ว!

source: Failed to update title:
th: ไม่สามารถอัปเดตชื่อเกมได้:

# pleaseUploadFile
source: Please upload a file first
th: กรุณาอัปโหลดไฟล์ก่อน

# cannotReversion
source: Cannot re-version: No source file available
th: ไม่สามารถสร้างเวอร์ชันใหม่ได้: ไม่มีไฟล์ต้นฉบับ

# confirmReversionTitle
source: Confirm Re-Version
th: ยืนยันการสร้างเวอร์ชันใหม่

# confirmReversionMessage
source: Are you sure you want to re-version...
th: คุณแน่ใจหรือไม่ว่าต้องการสร้างเวอร์ชันใหม่...

source: Cancel
th: ยกเลิก

source: Re-Version
th: สร้างเวอร์ชันใหม่

# confirmDeleteTitle
source: Confirm Delete
th: ยืนยันการลบ

# confirmDeleteMessage
source: Are you sure you want to delete...
th: คุณแน่ใจหรือไม่ว่าต้องการลบ...

source: Delete
th: ลบ

source: Game deleted.
th: ลบเกมแล้ว

source: Error deleting game:
th: เกิดข้อผิดพลาดในการลบเกม:

# shareGameTitle
source: Share Game
th: แชร์เกม

# shareGameMessage
source: Share this game code with others:
th: แชร์รหัสเกมนี้กับผู้อื่น:

# gameCodeCopied
source: Game code copied to clipboard!
th: คัดลอกรหัสเกมไปยังคลิปบอร์ดแล้ว!

source: Select Game Icon
th: เลือกไอคอนเกม

source: No icons available
th: ไม่มีไอคอน

source: Change Icon
th: เปลี่ยนไอคอน

# cannotAddLecture
source: Cannot add lecture: Upload failed or invalid game
th: ไม่สามารถเพิ่มบทเรียน: การอัปโหลดล้มเหลวหรือเกมไม่ถูกต้อง

source: Add Lecture
th: เพิ่มบทเรียน

# addLectureMessage
source: Adding a lecture will extend the current game with new content from a PDF file. Continue?
th: การเพิ่มบทเรียนจะขยายเกมปัจจุบันด้วยเนื้อหาใหม่จากไฟล์ PDF ดำเนินการต่อ?

# continueText
source: Continue
th: ดำเนินการต่อ

source: No play history
th: ไม่มีประวัติการเล่น

source: Play Game
th: เล่นเกม

# slideUpToCreate
source: Slide up to create a new game
th: เลื่อนขึ้นเพื่อสร้างเกมใหม่

source: Played history
th: ประวัติการเล่น

# uploadPdfFile
source: Upload PDF file to continue
th: อัปโหลดไฟล์ PDF เพื่อดำเนินการต่อ

# selectPdfDocument
source: Select a PDF document to create your game
th: เลือกเอกสาร PDF เพื่อสร้างเกมของคุณ

source: Upload Complete!
th: อัปโหลดเสร็จสมบูรณ์!

source: Uploading File...
th: กำลังอัปโหลดไฟล์...

source: Create Game
th: สร้างเกมส์

source: Import Game
th: นำเข้าเกม

source: Game Path
th: เส้นทางเกม

# gamePathHint
source: Paste the game path here
th: วางเส้นทางเกมที่นี่

# enterGamePathMessage
source: Enter the path of the game you want to import to your collection
th: ป้อนเส้นทางของเกมที่คุณต้องการนำเข้าสู่คอลเลกชันของคุณ

# gamePathEmpty
source: Game path cannot be empty
th: เส้นทางเกมไม่สามารถว่างได้

# gameImportedSuccess
source: Game imported successfully
th: นำเข้าเกมสำเร็จ

source: Import
th: นำเข้า

source: home
th: หน้าแรก

source: games
th: เกม

source: history
th: ประวัติ

source: profile
th: โปรไฟล์

# expianedmaincreategame
source: Let’s Gamify Your Learning!
th: มาเปลี่ยนการเรียนรู้ของคุณให้สนุกเหมือนเล่นเกมกันเถอะ!

# makeStudyingFun
source: Make studying fun! Just upload your file and start playing.
th: ทำให้การเรียนสนุก! เพียงอัปโหลดไฟล์ของคุณ และเริ่มเล่น

source: Success rate
th: อัตราความสำเร็จ

# outOfQuestions
source: out of {number} questions
th: จาก {number} คำถาม

source: Recent Game
th: เกมล่าสุด

source: World War 2
th: สงครามโลกครั้งที่ 2

source: Replay
th: เล่นซ้ำ

source: Start
th: เริ่มต้น

# gamifyLearning
source: Let's Gamify Your Learning!
th: สร้างเกมการเรียนรู้กันเถอะ!

source: View all
th: ดูทั้งหมด

source: No history found
th: ไม่พบประวัติ

source: Check
th: ตรวจสอบ

source: Next
th: ถัดไป

source: My Profile
th: โปรไฟล์ของฉัน

source: Edit Profile
th: แก้ไขโปรไฟล์

source: Setting
th: การตั้งค่า

source: Theme
th: ธีม

source: Light Open
th: โหมดสว่าง

source: Dark Open
th: โหมดมืด

source: Support
th: ช่วยเหลือ

source: Log Out
th: ออกจากระบบ

# areYouSureLogout
source: Are you sure you want to log out?
th: คุณแน่ใจหรือไม่ว่าต้องการออกจากระบบ?

# loggedOutSuccess
source: Logged Out Successfully!
th: ออกจากระบบสำเร็จ!

source: Correct
th: ถูก

source: Wrong
th: ผิด

source: Submit
th: ส่ง

source: Answer
th: คำตอบ

source: Play Bingo
th: เล่นบิงโก

# pointsLabel
source: {point} Points
th: {point} คะแนน

# yourPoints
source: You have {score} points.
th: คุณมี {score} คะแนน

# bingoRequirement
source: To pass the bingo selection or collect 75 or more points.
th: เพื่อผ่านเกมนี้ คุณต้องบิงโกหรือสะสมคะแนนให้ครบ 75 คะแนนขึ้นไป

source: Game Completed!
th: เกมสำเร็จ!

# congratulationsBingo
source: Congratulations! You got BINGO!
th: ยินดีด้วย! คุณได้บิงโก!

# congratulationsScore
source: Congratulations! You scored over 75 points!
th: ยินดีด้วย! คุณได้คะแนนมากกว่า 75 คะแนน!

# sorryNoWin
source: Sorry, you didn't achieve BINGO or reach 75 points!
th: เสียใจด้วย คุณไม่ได้บิงโกหรือคะแนนไม่ถึง 75 คะแนน!

source: Answer Questions
th: ตอบคำถาม

source: No played history
th: ไม่มีประวัติการเล่น

# noUserFound
source: User not found
th: ไม่พบบัญชี

# createssuccess
source: Success!
th: สำเร็จ!

# successfully
source: Your game has been created successfully
th: เกมของคุณถูกสร้างขึ้นสำเร็จแล้ว

source: Start Playing
th: เริ่มเล่น

# viewgame
source: View My Games
th: ดูเกมของฉัน

# tooltipclose
source: Close
th: ปิด

# noExplanationAvailable
source: Choose your icon
th: เลือกไอคอนเกม

source: Failed to load explanation
th: ไม่สามารถโหลดคำอธิบายได้

# sideuptocreateanewgame
source: Slide up to create a new game
th: เลื่อนขึ้นเพื่อสร้างเกมใหม่

source: No play history yet
th: ยังไม่มีประวัติการเล่น

# playgames
source: Play Game
th: เล่นเกม

source: Played history
th: ประวัติการเล่น

# uploadPDFfilecontinue
source: Upload PDF file to continue
th: อัพโหลดไฟล์ PDF เพื่อดำเนินการต่อ

source: User not logged in
th: ผู้ใช้ไม่ได้เข้าสู่ระบบ

# expianedcreategame
source: Make studying fun! Just upload your file and start playing.
th: เปลี่ยนการเรียนให้สนุก! แค่อัปโหลดไฟล์แล้วเริ่มเล่นได้เลย!

# tabcomingsoon
source: Coming Soon...
th: เร็วๆนี้

# titleyesno
source: Yes or No
th: ใช่ หรือ ไม่

# expianedyesno
source: Slide to left for No, right for Yes.
th: เลื่อนซ้ายเพื่อเลือก ไม่ใช่ เลื่อนขวาเพื่อเลือก ใช่

source: Yes
th: ใช่

source: No
th: ไม่

# resultmain
source: Congrats!
th: ยินดีด้วย!

# resultexplain
source: You are the best!
th: คุณสุดยอดไปเลย!

source: Time
th: เวลา

source: Play Again
th: เล่นอีกครั้ง

# imporvetext
source: You scored 20% more than the previous time.
th: เยี่ยมเลย! คุณทำได้ดีกว่าครั้งก่อน 20

# exitmodalmain
source: Are you sure?
th: คุณแน่ใจไหม?

# exitmodal1
source: Your current score will not be saved if you exit now.
th: คะแนนนี้จะไม่ถูกบันทึกหากออกตอนนี้

# exitmodal2
source: Are you sure you want to leave?
th: ต้องการออกจากหน้านี้จริงหรือไม่?

# exit
source: Exit Game
th: ออกจากเกม

# completeGame
source: Complete a game
th: เล่นเกมให้จบ

# seeProgress
source: to see your progress!
th: เพื่อดูความก้าวหน้าของคุณ!

source: No Recent Games
th: ยังไม่มีเกมล่าสุด

# playFirstGame
source: Play your first game!
th: เล่นเกมแรกของคุณเลย!

# historyWillAppearHere
source: Your Learning History Will Appear Here
th: ประวัติการเรียนรู้ของคุณจะแสดงที่นี่

# completeGameToSeeHistory
source: Complete a game to see your history!
th: เล่นเกมให้จบเพื่อดูประวัติของคุณ!

source: Confirm Delete
th: ยืนยันว่าจะลบเกมส์

source: Language
th: ภาษา

# aboutapp
source: About
th: ข้อมูลเกี่ยวกับแอป

source: Remove Game
th: ลบเกมส์

# removeGameConfirmTitle
source: Remove Game
th: ลบเกมส์

# removeGameConfirmMessage
source: Are you sure you want to remove this game? This will delete it from your history.
th: คุณแน่ใจหรือไม่ว่าต้องการลบเกมนี้? การทำเช่นนี้จะลบเกมนี้ออกจากประวัติของคุณ

# gameRemovedSuccess
source: Game removed successfully
th: ลบเกมส์เรียบร้อยแล้ว

source: Delete Game
th: ลบเกมส์

# cannotbeundone
source: This cannot be undone.
th: นี่ไม่สามารถย้อนกลับได้.

# share
source: Share Game
th: แบ่งปันเกม

# sharegamecode
source: Share this game code with others:
th: แบ่งปันรหัสเกมนี้กับผู้อื่น:

source: Confirm Re-Version
th: ยืนยันการเวอร์ชันใหม่

# areYouSureReversion
source: Are you sure you want to re-version
th: คุณแน่ใจหรือไม่ว่าต้องการสร้างเวอร์ชันใหม่

# createversion
source: This will create a new version based on the same source file.
th: นี่จะสร้างเวอร์ชันใหม่โดยใช้ไฟล์ต้นฉบับเดียวกัน

source: Game icon updated!
th: ไอคอนเกมได้รับการอัปเดตแล้ว!

source: Error updating icon:
th: ข้อผิดพลาดในการอัปเดตไอคอน:

source: Failed to update icon:
th: ไม่สามารถอัปเดตไอคอน:

# refreshgame
source: Refresh Games
th: โหลดเกมอีกครั้ง

source: Enter new title
th: ป้อนชื่อเรื่องใหม่

source: Save title changes
th: บันทึกการเปลี่ยนแปลงชื่อเรื่อง

source: boost
th: บูสต์

# brainToSky
source: your brain to the sky
th: สมอง ของคุณสู่ท้องฟ้า

# errorSigningInWithGoogle
source: Error signing in with Google: {error}
th: เกิดข้อผิดพลาดในการลงชื่อเข้าใช้ด้วย Google: {error}

# appDescription
source: Play to learn application make you memorize class lecture more efficiently
th: แอปพลิเคชันเล่นเพื่อเรียนรู้ช่วยให้คุณ จดจำเนื้อหาการเรียนได้อย่างมีประสิทธิภาพมากขึ้น

source: Sign in with Google
th: เข้าสู่ระบบด้วย Google

# profilePictureUpdated
source: Profile picture updated successfully!
th: อัปเดตรูปโปรไฟล์เรียบร้อยแล้ว!

source: Setting Support
th: การตั้งค่าการสนับสนุน

# supportPageTitle
source: This is Support Page
th: นี่คือหน้าการสนับสนุน

source: English
th: ภาษาอังกฤษ

source: Thai
th: ภาษาไทย

source: About App
th: เกี่ยวกับแอป

source: Version 3.3.1
th: เวอร์ชัน 3.3.1

source: Terms of Use
th: ข้อกำหนดในการใช้งาน

# playToLearnDescription
source: Play to learn application make you memorize class lecture more efficiently
th: แอปเล่นเพื่อเรียนรู้ช่วยให้คุณ จดจำเนื้อหาจากการเรียนได้อย่างมีประสิทธิภาพมากขึ้น

source: Save
th: บันทึก

source: Username
th: ชื่อผู้ใช้

source: Email
th: อีเมล

source: Personalize
th: ปรับแต่ง
